<a href="https://colab.research.google.com/github/santhoshml/python-practice/blob/main/pandas_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [3]:
my_series = [1, 3, 6, 78, 90]
my_var = pd.Series(my_series)
my_var

0     1
1     3
2     6
3    78
4    90
dtype: int64

In [4]:
my_var[2]

6

In [5]:
my_index = ['a', 'b', 'c', 'd', 'e']
my_var = pd.Series(my_series, index=my_index)
my_var

a     1
b     3
c     6
d    78
e    90
dtype: int64

In [6]:
my_var['c']

6

In [7]:
cars = {"Tesla": 12, "Mercedes": 25, "BMW": 30}
my_var = pd.Series(cars)
my_var

Tesla       12
Mercedes    25
BMW         30
dtype: int64